micropython/micropython/ports/nordic/boards/Seeed_XIAO_nRF52840_Sense/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2016 Glenn Ruben Bakke
// SPDX-FileCopyrightText: Copyright (c) 2018 Dan Halbert for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

#include "nrfx/hal/nrf_gpio.h"

#define MICROPY_HW_BOARD_NAME       "Seeed XIAO nRF52840 Sense"
#define MICROPY_HW_MCU_NAME         "nRF52840"

#if QSPI_FLASH_FILESYSTEM
#define MICROPY_QSPI_DATA0                NRF_GPIO_PIN_MAP(0, 20)
#define MICROPY_QSPI_DATA1                NRF_GPIO_PIN_MAP(0, 24)
#define MICROPY_QSPI_DATA2                NRF_GPIO_PIN_MAP(0, 22)
#define MICROPY_QSPI_DATA3                NRF_GPIO_PIN_MAP(0, 23)
#define MICROPY_QSPI_SCK                  NRF_GPIO_PIN_MAP(0, 21)
#define MICROPY_QSPI_CS                   NRF_GPIO_PIN_MAP(0, 25)
#endif

#define BOARD_HAS_CRYSTAL 1

#define DEFAULT_I2C_BUS_SCL         (&pin_P0_05)
#define DEFAULT_I2C_BUS_SDA         (&pin_P0_04)

#define DEFAULT_SPI_BUS_SCK         (&pin_P1_13)
#define DEFAULT_SPI_BUS_MOSI        (&pin_P1_15)
#define DEFAULT_SPI_BUS_MISO        (&pin_P1_14)

#define DEFAULT_UART_BUS_RX         (&pin_P1_12)
#define DEFAULT_UART_BUS_TX         (&pin_P1_11)

#define CIRCUITPY_RGB_STATUS_INVERTED_PWM
#define CIRCUITPY_RGB_STATUS_R      (&pin_P0_26)
#define CIRCUITPY_RGB_STATUS_G      (&pin_P0_30)
#define CIRCUITPY_RGB_STATUS_B      (&pin_P0_06)
